import { useState } from 'react';
import CustomCheckbox from '../customCheckbox/CustomCheckbox';
import './basketCard.scss'

const BasketCard: React.FC = () => {
    const [isChecked, setIsChecked] = useState(false);

    return (
        <div className='basket-card'>
            <div className="basket-card_checkbox-container">
                <CustomCheckbox
                    checked={isChecked}
                    onChange={() => setIsChecked(!isChecked)}
                    checkboxClass='basket-card_checkbox'
                />
            </div>
            <div className='basket-card_img'></div>
            <div className='basket-card_info'>
                <p className="basket-card_price text-price2">
                    5 520 ₽
                </p>
                <p className="basket-card_name text-n16">
                    Специальное чистящее средство для посудомоечной машины Интенсивный очиститель Сомат Intensve Machine Cleaner, 250 мл
                </p>
                <div className="basket-card_actions">
                    <button className='basket-card_btn'>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fillRule="evenodd" clipRule="evenodd" d="M16.3053 3.75C14.9937 3.75 13.7335 4.28909 12.8047 5.25232L12.5395 5.52714C12.3982 5.67365 12.2034 5.75641 11.9998 5.75642C11.7962 5.75642 11.6013 5.67365 11.46 5.52714L11.1949 5.25229C9.26309 3.24988 6.12529 3.24988 4.19352 5.2523C2.26883 7.24739 2.26883 10.477 4.19352 12.4721L11.4886 20.034C11.7573 20.3126 12.2054 20.3232 12.4874 20.0573C14.1657 18.4409 15.7608 16.747 17.368 15.0402C18.1737 14.1847 18.9823 13.3259 19.806 12.4721C20.7292 11.5156 21.25 10.2178 21.25 8.86222C21.25 7.50674 20.7294 6.20909 19.8061 5.2524C18.8773 4.28925 17.617 3.75 16.3053 3.75ZM11.9999 3.94228C13.1757 2.85872 14.7069 2.25 16.3053 2.25C18.0313 2.25 19.679 2.95977 20.8854 4.21074C22.0832 5.45181 22.75 7.1248 22.75 8.86222C22.75 10.5997 22.0831 12.2728 20.8854 13.5137C20.089 14.3393 19.2938 15.1836 18.4945 16.0323C16.871 17.7562 15.2301 19.4985 13.5256 21.14L13.5216 21.1438C12.6426 21.9779 11.2505 21.9476 10.409 21.0754L3.11399 13.5136C0.62867 10.9374 0.62867 6.78707 3.11399 4.21085C5.54605 1.68984 9.46239 1.60032 11.9999 3.94228Z" fill="black"/>
                        </svg>
                    </button>
                    <button className='basket-card_btn'>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fillRule="evenodd" clipRule="evenodd" d="M20.13 8.26133C20.538 8.33306 20.8105 8.72193 20.7388 9.12988L18.7438 20.4761C18.7438 20.4762 18.7438 20.4762 18.7438 20.4762C18.5126 21.7911 17.3704 22.75 16.0354 22.75H7.96486C6.62979 22.75 5.4876 21.7911 5.25642 20.4762L3.26146 9.12988C3.18973 8.72192 3.46229 8.33306 3.87025 8.26133C4.2782 8.18961 4.66707 8.46217 4.73879 8.87013L6.73375 20.2164C6.83885 20.8141 7.35804 21.25 7.96486 21.25H16.0354C16.6422 21.25 17.1614 20.8141 17.2664 20.2165L17.2665 20.2164L19.2615 8.87012C19.3332 8.46217 19.722 8.1896 20.13 8.26133Z" fill="black"/>
                            <path fillRule="evenodd" clipRule="evenodd" d="M10.625 2.75C9.93464 2.75 9.375 3.30964 9.375 4V5.25H14.625V4C14.625 3.30964 14.0654 2.75 13.375 2.75H10.625ZM7.875 5.25V4C7.875 2.48122 9.10622 1.25 10.625 1.25H13.375C14.8938 1.25 16.125 2.48122 16.125 4V5.25H21C21.4142 5.25 21.75 5.58579 21.75 6C21.75 6.41421 21.4142 6.75 21 6.75H3C2.58579 6.75 2.25 6.41421 2.25 6C2.25 5.58579 2.58579 5.25 3 5.25H7.875Z" fill="black"/>
                        </svg>
                    </button>
                </div>
            </div>
            <div className="basket-card_set">
                <div className='basket-card_count text-h2'>
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd" d="M7.25 12C7.25 11.5858 7.58579 11.25 8 11.25H16C16.4142 11.25 16.75 11.5858 16.75 12C16.75 12.4142 16.4142 12.75 16 12.75H8C7.58579 12.75 7.25 12.4142 7.25 12Z" fill="black"/>
                        <path fillRule="evenodd" clipRule="evenodd" d="M12 2.75C6.89137 2.75 2.75 6.89137 2.75 12C2.75 17.1086 6.89137 21.25 12 21.25C17.1086 21.25 21.25 17.1086 21.25 12C21.25 6.89137 17.1086 2.75 12 2.75ZM1.25 12C1.25 6.06294 6.06294 1.25 12 1.25C17.9371 1.25 22.75 6.06294 22.75 12C22.75 17.9371 17.9371 22.75 12 22.75C6.06294 22.75 1.25 17.9371 1.25 12Z" fill="black"/>
                    </svg>
                    <span>1</span>
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd" d="M12 7.25C12.4142 7.25 12.75 7.58579 12.75 8V11.25H16C16.4142 11.25 16.75 11.5858 16.75 12C16.75 12.4142 16.4142 12.75 16 12.75H12.75V16C12.75 16.4142 12.4142 16.75 12 16.75C11.5858 16.75 11.25 16.4142 11.25 16V12.75H8C7.58579 12.75 7.25 12.4142 7.25 12C7.25 11.5858 7.58579 11.25 8 11.25H11.25V8C11.25 7.58579 11.5858 7.25 12 7.25Z" fill="black"/>
                        <path fillRule="evenodd" clipRule="evenodd" d="M12 2.75C6.89137 2.75 2.75 6.89137 2.75 12C2.75 17.1086 6.89137 21.25 12 21.25C17.1086 21.25 21.25 17.1086 21.25 12C21.25 6.89137 17.1086 2.75 12 2.75ZM1.25 12C1.25 6.06294 6.06294 1.25 12 1.25C17.9371 1.25 22.75 6.06294 22.75 12C22.75 17.9371 17.9371 22.75 12 22.75C6.06294 22.75 1.25 17.9371 1.25 12Z" fill="black"/>
                    </svg>
                </div>
                <div className='basket-card_delivery text-desc'>
                    Доставка 15 апреля
                </div>
            </div>
        </div>
    );
};

export default BasketCard;